// @strict-types


#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИдентификаторДанныеДляИнтеграции_Настройки() Экспорт
	
	Возврат ВК_ИнтеграцияВызовСервера.ИдентификаторДанныеДляИнтеграции_Настройки()
	
КонецФункции

Функция ИмяПараметраТокен() Экспорт
	
	Возврат "Токен";
	
КонецФункции

Функция ИмяПараметраIDПриложения() Экспорт
	
	Возврат "IDПриложения";
	
КонецФункции

#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
