// @strict-types


#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры к подключению КHTTPСерверу.
// 
// Возвращаемое значение:
//  Структура - Параметры к подключению КHTTPСерверу:
// * Сервер - Строка -
// * Порт - Строка -
// * ЗащитноеСоединение - Булево -
Функция ПараметрыКПодключениюКHTTPСерверу() Экспорт
	
	СтруктураПараметров = Новый Структура();

	СтруктураПараметров.Вставить("Сервер", "");
	СтруктураПараметров.Вставить("Порт", "");
	СтруктураПараметров.Вставить("ЗащитноеСоединение", Ложь);

	Возврат СтруктураПараметров;
	
КонецФункции

// Идентификатор данные для интеграции настройки.
// 
// Возвращаемое значение:
//  СправочникСсылка.ВК_ИдентификаторыПредопределенныхЗначений - Идентификатор данные для интеграции настройки
Функция ИдентификаторДанныеДляИнтеграции_Настройки() Экспорт
	
	Возврат ВК_ИнтеграцияВызовСервера.ИдентификаторДанныеДляИнтеграции_Настройки()
	
КонецФункции

// Идентификатор данные для интеграции настройки подключения к серверу.
// 
// Возвращаемое значение:
//  СправочникСсылка.ВК_ИдентификаторыПредопределенныхЗначений - Идентификатор данные для интеграции настройки подключения к серверу
Функция ИдентификаторДанныеДляИнтеграции_НастройкиПодключенияКСерверу() Экспорт
	
	Возврат ВК_ИнтеграцияВызовСервера.ИдентификаторДанныеДляИнтеграции_НастройкиПодключенияКСерверу();
	
КонецФункции

// Имя параметра токен.
// 
// Возвращаемое значение:
//  Строка - Имя параметра токен
Функция ИмяПараметраТокен() Экспорт
	
	Возврат "Токен";
	
КонецФункции

// Имя параметра IDПриложения.
// 
// Возвращаемое значение:
//  Строка - Имя параметра IDПриложения
Функция ИмяПараметраIDПриложения() Экспорт
	
	Возврат "IDПриложения";
	
КонецФункции

// Имя параметра URLДля получения токена.
// 
// Возвращаемое значение:
//  Строка - Имя параметра URLДля получения токена
Функция ИмяПараметраURLДляПолученияТокена() Экспорт
	
	Возврат "URLДляПолученияТокена";
	
КонецФункции

// Имя параметра версия АПИ.
// 
// Возвращаемое значение:
//  Строка - Имя параметра версия АПИ
Функция ИмяПараметраВерсияАПИ() Экспорт
	
	Возврат "ВерсияАПИ";
	
КонецФункции

// Версия АПИ.
// 
// Возвращаемое значение:
//  Строка, Неопределено - Версия АПИ
Функция ВерсияАПИ() Экспорт
	
	#Если Клиент Тогда
		ВерсияАПИ = ВК_ИнтеграцияВызовСервера.ВерсияАпи();	
	#Иначе 
		ВерсияАПИ = ВК_Интеграция.ВерсияАпи();	
	#КонецЕсли
	
	Возврат ВерсияАПИ;
	
КонецФункции

// Шаблон URLДля получения токена.
// 
// Возвращаемое значение:
//  Строка, Неопределено - Шаблон URLДля получения токена
Функция ШаблонURLДляПолученияТокена() Экспорт
		
	Возврат ВК_ИнтеграцияВызовСервера.ШаблонURLДляПолученияТокена();
	
КонецФункции

#Область АпиЗапросы

// Имя метода получение информации о профиле.
// 
// Возвращаемое значение:
//  Строка - Имя метода получение информации о профиле
Функция ИмяМетодаПолучениеИнформацииОПрофиле() Экспорт
	
	Возврат "account.getProfileInfo";
	
КонецФункции


#КонецОбласти

#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
