// @strict-types
#Область ПрограммныйИнтерфейс

// Получить IDПриложения.
// 
// Возвращаемое значение:
//  Строка - Получить IDПриложения
Функция ПолучитьIDПриложения() Экспорт

	Возврат ВК_Интеграция.ПолучитьIDПриложения();

КонецФункции

// Версия апи.
// 
// Возвращаемое значение:
//  Строка, Неопределено - Версия апи
Функция ВерсияАпи() Экспорт
	
	Возврат ВК_Интеграция.ВерсияАпи();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИдентификаторДанныеДляИнтеграции_Настройки() Экспорт

	Возврат Справочники.ВК_ИдентификаторыПредопределенныхЗначений.ДанныеДляИнтеграции_Настройки;

КонецФункции

Функция ИдентификаторДанныеДляИнтеграции_НастройкиПодключенияКСерверу() Экспорт

	Возврат Справочники.ВК_ИдентификаторыПредопределенныхЗначений.ДанныеДляИнтеграции_НастройкиПодключенияКСерверу;

КонецФункции

// Шаблон URLДля получения токена.
// 
// Возвращаемое значение:
//  Строка, Неопределено - Шаблон URLДля получения токена
Функция ШаблонURLДляПолученияТокена() Экспорт

	ИдентификаторДанныеДляИнтеграции_Настройки = ИдентификаторДанныеДляИнтеграции_Настройки();
	ПараметрURLДляПолученияТокена = ВК_ИнтеграцияКлиентСервер.ИмяПараметраURLДляПолученияТокена();

	ШаблонURL = ВК_ОбщегоНазначения.ПолучитьПредопределенноеЗначение(ИдентификаторДанныеДляИнтеграции_Настройки,
		ПараметрURLДляПолученияТокена);

	Возврат ШаблонURL;

КонецФункции

// Параметры подключения.
// 
// Возвращаемое значение:
//  Структура - Параметры подключения:
// * ПараметрыHTTPСоединение - Неопределено -
// * ОписаниеОшибок - Массив -
// * АвторизацияВыполнена - Булево -
Функция ПараметрыПодключения() Экспорт
	
	Возврат ВК_Интеграция.ПараметрыПодключения();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти