// @strict-types
#Область ПрограммныйИнтерфейс

// Получить предопределенное значение.
// 
// Параметры:
//  Идентификатор - СправочникСсылка.ВК_ИдентификаторыПредопределенныхЗначений
//  Параметр - Строка
// 
// Возвращаемое значение:
//  ЛюбаяСсылка, Строка - возвращает значение, которое указано в параметре
Функция ПолучитьПредопределенноеЗначение(Идентификатор, Параметр) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВК_ЗначенияИдентификаторовПредопределенныхЗначений.Значение
	|ИЗ
	|	РегистрСведений.ВК_ЗначенияИдентификаторовПредопределенныхЗначений КАК
	|		ВК_ЗначенияИдентификаторовПредопределенныхЗначений
	|ГДЕ
	|	ВК_ЗначенияИдентификаторовПредопределенныхЗначений.Идентификатор = &Идентификатор
	|	И ВК_ЗначенияИдентификаторовПредопределенныхЗначений.Параметр = &Параметр";

	Запрос.УстановитьПараметр("Параметр", Параметр);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);

	РезультатЗапроса = Запрос.Выполнить();

	УстановитьПривилегированныйРежим(Ложь);

	Выборка = РезультатЗапроса.Выбрать();

	Выборка.Следующий();

	//@skip-check property-return-type
	Если ЗначениеЗаполнено(Выборка.Значение) Тогда
		//@skip-check variable-value-type
		ЗначениеИдентификатора = Выборка.Значение;
	Иначе
		ЗначениеИдентификатора = Неопределено;
	КонецЕсли;

	Возврат ЗначениеИдентификатора;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти