#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьТаблицуПараметров();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьИдентификаторыПредопределенныхЭлементов(ТекущийОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуПараметров()

	Запрос = Новый Запрос();

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияИдентификаторовПредопределенныхЗначений.Параметр,
	|	ЗначенияИдентификаторовПредопределенныхЗначений.Значение
	|ИЗ
	|	РегистрСведений.ВК_ЗначенияИдентификаторовПредопределенныхЗначений КАК ЗначенияИдентификаторовПредопределенныхЗначений
	|ГДЕ
	|	ЗначенияИдентификаторовПредопределенныхЗначений.Идентификатор = &Идентификатор";

	Запрос.УстановитьПараметр("Идентификатор", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаПараметров.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИдентификаторыПредопределенныхЭлементов(ТекущийОбъект)

	НаборЗаписей = РегистрыСведений.ВК_ЗначенияИдентификаторовПредопределенныхЗначений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Идентификатор.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();

	НаборЗаписей.Очистить();

	Для Каждого Стр Из ТаблицаПараметров Цикл

		Запись = НаборЗаписей.Добавить();
		Запись.Идентификатор = Объект.Ссылка;

		ЗаполнитьЗначенияСвойств(Запись, Стр);

	КонецЦикла;

	НаборЗаписей.Записать(Истина);

КонецПроцедуры

#КонецОбласти