// @strict-types
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Декорация_ПолучитьТокенНажатие(Элемент)

	IDПриложения = ВК_ИнтеграцияВызовСервера.ПолучитьIDПриложения();

	Если ЗначениеЗаполнено(IDПриложения) Тогда
		КомандаЗапуска = КомандаЗапускаБраузера(IDПриложения);
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(КомандаЗапуска);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

&НаКлиенте
Процедура Войти(Команда)

	Если СохранитьТокен = Истина Тогда
		СохранитьТокен();
	КонецЕсли;	

КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

// Команда запуска браузера.
// 
// Параметры:
//  IDПриложения - Строка
// 
// Возвращаемое значение:
//  Строка - Команда запуска браузера
&НаСервереБезКонтекста
Функция КомандаЗапускаБраузера(IDПриложения)

	ШаблонКоманды = "https://oauth.vk.com/authorize?client_id=51639199&redirect_uri=https://vk.com/&scope=12&display=page&response_type=token";

	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКоманды, IDПриложения);

КонецФункции

&НаСервереБезКонтекста
Процедура ВойтиНаСервере(Токен)

	ВК_Интеграция.СохранитьТокен();	
	ВК_Интеграция.

КонецПроцедуры

#КонецОбласти